the 10027055
of 4587086
to 4566012
in 3906588
and 3414395
said 2511393
on 2155635
for 1664451
at 1281038
was 1160891
that 1143953
is 1086192
it 1066127
by 982213
with 956024
from 934724
percent 857975
be 806244
as 762359
million 726400
he 710222
year 673622
its 668590
will 653452
has 598752
but 596463
were 578481
an 569515
would 560721
not 553982
are 549324
have 537104
which 517309
had 503678
market 456507
this 452646
up 439784
new 435347
we 408281
after 401950
bank 375841
one 370881
they 365045
company 357352
last 332567
government 331941
been 328076
also 307456
two 306608
billion 306571
his 300674
their 297054
first 292165
or 291005
shares 281766
more 275569
over 274325
about 273657
newsroom 260182
there 252838
week 250915
share 246184
who 245482
than 241103
some 241006
may 235280
per 228328
no 226528
tuesday 222208
three 221393
pct 219909
all 217783
expected 215475
wednesday 215426
net 214706
thursday 214393
other 212406
group 208866
monday 208049
friday 207227
prices 203402
state 200172
could 198120
sales 196189
told 192334
out 191802
trade 191650
if 188392
price 187255
down 186904
against 185665
day 182673
into 180960
month 177786
president 176637
minister 174169
stock 170782
when 170491
rate 166959
vs 163452
interest 160771
time 160459
oil 157649
months 156241
foreign 153462
years 153373
income 153233
next 153170
june 150248
between 150137
points 149863
before 147982
end 147897
yen 147802
people 147643
high 145524
european 145339
while 145013
index 144768
inc 144077
quarter 141119
under 140046
total 139395
march 138258
international 137839
only 135913
since 135001
dollar 133575
tax 131527
most 131064
rates 130714
central 130426
corp 130013
reuters 129633
due 129092
off 128698
added 128229
now 127957
july 127750
business 126807
world 126123
profit 125646
can 125265
five 125155
trading 124644
exchange 124567
ended 124283
economic 124123
higher 123456
second 123261
rose 122572
tonnes 121981
traders 121760
official 121390
any 121295
growth 120682
co 120415
statement 120158
should 118808
national 118607
news 118473
ltd 118310
cents 118238
loss 118100
because 118068
financial 117506
united 116327
general 114938
companies 114250
analysts 114165
still 112006
london 111928
south 111620
four 111392
close 111126
lower 111022
around 110953
our 109070
states 108820
party 108542
six 107935
so 106891
made 106522
officials 106174
capital 106138
based 105401
current 104282
long 104135
earlier 103697
through 102573
markets 102479
country 102449
york 102146
average 102143
early 101571
investment 101018
report 100767
industry 100347
china 100257
union 100199
issue 100063
set 99510
earnings 99476
during 98041
april 97514
meeting 97065
very 96940
december 96323
us 95675
back 95526
following 93922
september 93869
term 93313
closed 93161
investors 93035
rise 92777
major 92179
securities 92119
take 91625
them 90315
public 89989
fell 89916
half 89869
ago 89746
data 89592
bonds 89466
stocks 89127
bond 88866
what 88829
well 88477
finance 87826
deal 87591
these 87124
further 87046
demand 86800
chief 86600
local 86112
power 85992
results 85792
being 85124
low 84592
just 84571
note 84345
strong 84271
january 84108
city 83474
reported 83288
prime 83256
dealers 82844
both 82558
did 82526
banks 81738
another 81347
increase 81235
firm 81207
days 81129
such 80718
operating 80709
budget 80625
british 80147
late 79964
money 79642
make 79182
commission 78664
many 78458
currency 77793
where 77710
she 77684
including 77016
talks 76786
futures 76741
do 76630
police 76588
part 76389
production 76368
period 76073
german 75967
say 75731
former 75476
europe 75369
spokesman 75250
plans 74983
level 74468
support 74305
much 74161
countries 73363
good 73208
recent 72613
see 72330
japan 72115
agreement 72014
kong 71979
hong 71934
compared 71879
political 71830
same 71753
board 71474
october 71334
number 71243
third 71235
full 70361
gmt 70236
august 70134
services 70098
sector 69988
gold 69193
cut 69177
previous 69046
ministry 69043
likely 68969
change 68900
economy 68733
system 68574
uk 68565
french 68125
gas 68075
november 67942
pay 67939
forecast 67869
products 67768
court 67543
you 67462
inflation 67326
debt 67042
think 66890
chairman 66358
cash 66300
policy 66156
france 66003
basis 65746
sale 65545
seen 65503
north 65482
fund 65371
held 65231
short 65231
operations 65077
plan 64977
announced 64691
saying 64384
buy 64366
funds 64291
unit 64257
volume 63938
development 63932
going 63844
domestic 63585
eu 63464
offer 63313
re 63299
conference 63194
date 63102
those 62987
germany 62962
federal 62929
way 62629
open 62561
service 62534
until 62498
trader 62428
record 62295
sunday 62186
ahead 61914
bid 61873
go 61664
house 61453
february 61177
called 60989
start 60871
top 60648
decision 60629
move 60262
even 60149
already 60021
today 59959
figures 59824
bln 59657
american 59577
then 59530
later 59415
india 59213
won 58987
seven 58958
like 58950
cost 58882
industrial 58479
contract 58090
leading 57928
common 57852
east 57829
mark 57679
put 57651
exports 57575
key 57458
latest 57299
security 56935
wheat 56843
above 56839
parliament 56696
executive 56454
election 56341
continue 55867
get 55820
dec 55759
buying 55642
de 55629
analyst 55569
costs 55485
sell 55376
bill 55352
him 55323
home 54948
britain 54682
traded 54671
sources 54412
however 54382
saturday 54147
leader 54034
marks 54031
main 53925
several 53719
credit 53657
point 53588
sold 53561
future 53440
members 53282
lead 53225
near 53224
her 53161
selling 53121
far 53104
non 53070
war 52884
annual 52788
law 52772
jan 52708
work 52682
plc 52656
few 52420
director 52376
each 52223
final 52069
office 52016
line 51995
help 51969
says 51881
fall 51842
little 51832
left 51792
head 51742
levels 51574
value 51558
according 51545
among 51545
west 51539
call 51524
opposition 51496
quoted 51481
largest 51306
australia 51187
used 50698
yield 50697
agreed 50555
revenues 50432
russia 50407
right 50387
range 50203
whether 50135
monetary 50129
issues 49999
past 49915
despite 49810
run 49774
agency 49753
private 49726
led 49678
labour 49545
planned 49425
treasury 49384
committee 49334
australian 49296
management 49279
weeks 49198
military 49164
come 49031
consumer 48846
chicago 48812
although 48744
taking 48600
council 48467
japanese 48424
stake 48365
peace 48323
how 48243
daily 48199
old 48149
air 47910
possible 47845
food 47812
amount 47787
nine 47718
must 47680
singapore 47482
tonne 47418
unless 47356
region 47278
clinton 47158
russian 46834
aug 46561
use 46300
owned 46113
took 45910
profits 45893
big 45849
senior 45849
area 45756
does 45754
deficit 45668
might 45549
within 45257
gains 45086
morning 44983
nov 44940
dealer 44938
meet 44934
export 44811
crude 44689
department 44648
oct 44557
energy 44434
large 44311
give 44270
research 44209
western 44201
force 44191
place 44138
without 44081
real 44013
dividend 44010
asked 43867
eight 43792
less 43751
information 43532
don 43455
least 43449
below 43445
workers 43434
hit 43340
turnover 43277
newsdesk 43232
showed 43186
result 43163
reporters 43157
francs 42591
rights 42467
brokers 42450
want 42303
available 42150
unchanged 42098
shareholders 42064
increased 42043
times 41850
session 41834
own 41738
firms 41665
continued 41658
street 41641
too 41616
th 41586
member 41574
supply 41529
small 41527
cargo 41509
control 41464
need 41414
israel 41403
pressure 41394
lost 41340
retail 41158
leaders 41067
commercial 41057
plant 40938
gdp 40820
hold 40777
newspaper 40733
case 40672
joint 40556
assets 40262
expect 40198
return 40194
product 40137
issued 39996
television 39959
taxes 39933
output 39835
yet 39641
again 39463
taken 39269
name 39262
order 39220
balance 39204
series 39184
came 39147
worth 39132
italy 39128
insurance 38944
paper 38923
estimated 38853
fiscal 38834
elections 38799
rupees 38755
losses 38750
desk 38684
canada 38613
feb 38562
africa 38478
terms 38288
free 38269
health 38073
making 38072
slightly 37881
problems 37650
better 37638
given 37496
remain 37441
imports 37259
steady 37237
revenue 37236
northern 37231
fourth 37075
project 36738
action 36695
rating 36673
banking 36602
remained 36540
holding 36507
position 36301
john 36175
mexico 36051
merger 35984
unemployment 35984
biggest 35743
details 35741
reserve 35737
process 35601
offered 35581
chinese 35571
vote 35531
strike 35520
defence 35505
wall 35485
single 35396
life 35268
washington 35085
association 34996
dollars 34978
reports 34949
yr 34933
currently 34903
team 34826
become 34767
found 34674
paris 34654
conditions 34644
centre 34479
pounds 34419
secretary 34398
comment 34330
programme 34316
post 34308
stg 34289
army 34288
include 34288
pre 34274
taiwan 34224
asia 34201
crowns 34179
building 34176
saw 34155
delivery 33996
southern 33910
clear 33726
looking 33690
released 33568
signed 33481
target 33478
african 33442
keep 33396
proposed 33393
forces 33372
source 33365
outstanding 33338
press 33194
global 33153
israeli 33133
except 33126
media 33102
adding 33054
car 33027
reached 32954
technology 32891
stories 32791
charges 32749
swiss 32724
mid 32694
manager 32575
killed 32555
st 32486
contracts 32468
authorities 32327
raise 32244
win 32047
gave 32038
season 31949
special 31941
spending 31918
hours 31876
white 31830
raised 31727
mln 31650
bills 31620
here 31525
best 31498
show 31435
gross 31431
port 31410
coming 31407
working 31399
mar 31343
bought 31320
hk 31258
korea 31190
eastern 31129
approved 31123
overall 31117
nations 31073
ruling 31058
reserves 31021
sept 31003
declined 30948
heavy 30942
construction 30924
areas 30908
account 30763
america 30762
property 30757
thousands 30647
soon 30611
maturity 30578
received 30532
believe 30531
capacity 30506
fuel 30480
lot 30377
base 30372
town 30283
tokyo 30278
nearly 30252
sugar 30216
iraq 30199
light 30185
recently 30130
positive 30111
coupon 30081
measures 30067
campaign 30025
corporate 29930
division 29901
opening 29894
holdings 29827
weekend 29772
important 29734
equity 29703
coalition 29680
rising 29548
thu 29540
afternoon 29514
impact 29496
changes 29409
potential 29408
social 29403
whose 29399
expectations 29359
regional 29245
visit 29237
systems 29222
indian 29202
offering 29113
competition 29110
groups 29089
list 29089
fri 29078
players 29068
overnight 29038
congress 29023
bourse 29012
parties 28998
notes 28965
allow 28923
jun 28911
provide 28880
began 28864
crop 28854
side 28847
orders 28824
gulf 28808
situation 28703
canadian 28683
cent 28441
almost 28395
scheduled 28391
ministers 28309
round 28285
copper 28267
troops 28262
auction 28249
loans 28225
my 28214
started 28060
expects 28053
goods 28038
spot 28037
expenses 28031
growing 27975
rule 27935
telephone 27926
italian 27802
away 27764
deputy 27683
tender 27668
vice 27661
dutch 27647
jobs 27606
charge 27593
eps 27515
gain 27491
officer 27480
alliance 27475
mon 27475
performance 27462
sa 27414
options 27394
bureau 27385
needed 27360
able 27356
proposal 27331
activity 27307
independent 27239
apr 27224
industries 27164
spread 27102
face 27075
rebels 27047
venture 27037
failed 26980
sep 26961
maker 26958
majority 26940
rally 26937
effect 26902
shr 26901
outside 26848
immediately 26815
aid 26777
included 26763
billions 26699
loan 26657
once 26657
interview 26586
spain 26564
units 26555
fixed 26539
release 26534
moscow 26516
jul 26508
forward 26474
settlement 26466
paid 26422
decided 26357
radio 26335
democratic 26329
km 26221
probably 26221
network 26198
others 26142
trust 26138
nation 26134
hard 26086
problem 26085
al 25933
municipal 25897
emu 25892
steel 25858
across 25854
trend 25851
sydney 25819
front 25769
negotiations 25583
drop 25553
numbers 25552
nato 25505
water 25503
active 25502
privatisation 25486
closing 25451
behind 25417
brazil 25383
reform 25350
forecasts 25314
survey 25303
authority 25198
limited 25102
poor 25072
indonesia 25051
risk 24994
operation 24982
man 24978
fresh 24973
economist 24962
related 24926
look 24906
boost 24887
producer 24846
computer 24823
bids 24820
ag 24787
enough 24749
republic 24718
cup 24696
noted 24695
human 24600
barrels 24576
wed 24550
night 24457
coffee 24452
cabinet 24411
helped 24403
pacific 24279
parent 24255
cuts 24228
drug 24228
land 24226
towards 24222
david 24205
launched 24189
women 24178
having 24159
crisis 24144
customers 24088
approval 24060
legal 24007
communications 23966
weather 23950
technical 23938
miles 23930
yeltsin 23921
middle 23908
wanted 23866
czech 23834
game 23796
administration 23788
know 23770
match 23761
blue 23722
fed 23711
known 23704
went 23700
percentage 23693
estimate 23672
economists 23656
acquisition 23583
morgan 23516
every 23508
trying 23500
significant 23495
opened 23444
marketing 23436
summit 23427
sharply 23409
rand 23408
grain 23382
kg 23342
beijing 23333
additional 23332
asian 23332
test 23290
great 23268
accounts 23228
county 23172
reach 23163
done 23147
ex 23123
league 23096
school 23039
zealand 23037
equipment 23018
men 22929
gained 22903
decline 22883
page 22861
along 22850
corn 22843
housing 22787
efforts 22779
ve 22743
pakistan 22684
confirmed 22631
got 22619
build 22585
attack 22569
previously 22562
fax 22551
coast 22541
announcement 22460
pesos 22419
bring 22388
certain 22384
investments 22355
met 22346
rules 22284
confidence 22241
strength 22187
buyers 22172
weighted 22123
calls 22122
purchase 22119
vessels 22119
avg 22055
actual 22046
estimates 22018
weekly 21999
beat 21989
job 21977
weak 21959
district 21949
form 21935
island 21922
plus 21920
relations 21878
barrel 21823
involved 21820
initial 21808
concern 21802
monthly 21774
specified 21750
anti 21746
includes 21741
fully 21737
find 21735
internet 21710
dropped 21708
figure 21652
join 21642
longer 21603
competitive 21602
mainly 21601
rather 21582
projects 21534
though 21516
family 21466
ending 21462
red 21445
amid 21439
institute 21418
launch 21413
allowed 21395
communist 21371
moody 21366
view 21344
play 21329
changed 21295
england 21282
children 21281
poland 21242
expense 21220
businesses 21202
broker 21180
import 21168
followed 21166
border 21157
sent 21153
subsidiary 21151
standard 21133
present 21131
access 21086
wants 21077
expansion 21069
transport 21018
talk 21013
mostly 20998
primary 20992
difficult 20975
restructuring 20965
organisation 20943
break 20910
trillion 20906
death 20904
palestinian 20898
civil 20895
reforms 20891
really 20872
deals 20865
reduce 20840
victory 20824
role 20795
airport 20790
poll 20770
positions 20725
supplies 20677
airlines 20672
fighting 20598
na 20572
begin 20559
continuing 20543
zaire 20533
recovery 20485
cooperation 20438
yuan 20435
community 20377
mining 20367
completed 20360
moving 20306
existing 20302
trial 20274
named 20222
petroleum 20205
rest 20188
focus 20184
hope 20182
similar 20182
natural 20114
seeking 20112
electricity 20099
treaty 20074
corporation 20058
accused 19995
cannot 19958
benchmark 19937
remains 19916
weaker 19876
dow 19849
sea 19835
texas 19813
brought 19795
liquidity 19781
brussels 19770
direct 19757
tue 19737
step 19712
flat 19681
fire 19680
turkey 19653
progress 19592
arab 19573
died 19512
staff 19501
thailand 19500
div 19441
highest 19438
review 19437
parliamentary 19427
gasoline 19424
employment 19356
listed 19331
payments 19285
stage 19281
bombay 19266
premium 19262
outlook 19256
try 19246
affairs 19228
using 19204
improve 19200
hour 19165
sharp 19157
warned 19110
sign 19068
surplus 19006
concerns 18982
posted 18969
holiday 18948
nil 18944
province 18927
stated 18906
savings 18901
question 18899
needs 18883
believed 18881
manufacturing 18875
discuss 18842
falling 18827
club 18807
never 18803
together 18800
yesterday 18778
lbs 18774
act 18772
san 18735
nuclear 18733
spokeswoman 18733
comments 18730
frankfurt 18715
ground 18715
senate 18700
employees 18684
forced 18630
slow 18585
running 18579
sterling 18570
personal 18538
newspapers 18534
partners 18528
pound 18519
agriculture 18512
caused 18484
resources 18480
prior 18475
whole 18455
played 18418
aircraft 18403
discount 18397
particularly 18373
governor 18363
denied 18344
especially 18335
telecom 18330
am 18326
beginning 18319
yields 18302
aimed 18265
stronger 18262
finished 18242
overseas 18217
moved 18201
tobacco 18197
software 18179
refugees 18138
bit 18121
speculation 18104
movement 18053
michael 18039
either 18021
subject 18013
stop 18001
published 17960
millions 17886
appeared 17881
me 17845
pro 17842
quality 17825
giant 17815
electric 17780
turn 17763
presidential 17751
huge 17735
sentiment 17706
minutes 17691
serious 17681
stay 17662
institutions 17658
brent 17648
leave 17621
statistics 17598
versus 17589
means 17575
activities 17534
euro 17515
violence 17510
fact 17494
remaining 17447
netanyahu 17443
planning 17429
lack 17409
california 17382
usa 17365
iran 17334
ready 17324
territory 17320
effective 17270
smith 17258
mo 17236
korean 17225
goal 17202
normal 17202
waiting 17174
fob 17151
reduced 17131
claims 17123
managing 17108
hospital 17097
stability 17050
young 17050
hopes 16999
book 16974
summer 16956
conservative 16932
itself 16926
malaysia 16913
wage 16909
interests 16872
offers 16844
chip 16841
backed 16820
nothing 16782
airline 16765
create 16745
reason 16713
games 16706
turned 16687
stable 16682
medical 16665
cars 16647
kept 16628
entry 16624
republican 16620
letter 16616
belgian 16578
merrill 16575
resistance 16561
shot 16552
field 16549
saudi 16519
benefit 16517
investigation 16515
strategy 16501
policies 16500
things 16471
preliminary 16428
hand 16421
lots 16385
farmers 16377
iraqi 16369
study 16369
parts 16353
quarterly 16348
chance 16318
cpi 16262
rival 16241
black 16162
peter 16159
metal 16157
cover 16134
ireland 16102
pence 16101
firmer 16095
sides 16050
pact 16048
body 16006
brokerage 16000
asset 15997
lb 15972
improved 15966
thai 15964
built 15955
makes 15937
usda 15919
road 15883
course 15877
increasing 15869
stores 15852
size 15851
minimum 15830
provided 15789
bad 15787
robert 15782
cross 15774
prepared 15756
provision 15713
distribution 15694
holds 15684
evidence 15682
sweden 15641
negative 15637
approx 15628
highs 15619
justice 15609
soldiers 15606
quite 15601
hands 15591
irish 15571
starting 15549
urged 15543
james 15535
jones 15500
care 15479
medium 15477
different 15474
quiet 15437
limit 15410
plants 15400
hungary 15339
items 15331
seek 15321
getting 15308
imf 15299
fears 15277
judge 15273
carried 15272
assembly 15269
live 15261
aaa 15252
improvement 15245
ensure 15243
double 15227
investor 15220
unlikely 15209
response 15204
mixed 15196
partner 15185
moslem 15169
necessary 15145
grade 15133
thought 15126
unions 15126
accuracy 15110
stood 15109
lending 15108
cattle 15107
tight 15106
advertising 15101
listing 15096
bundesbank 15093
paul 15043
giving 15005
ban 15004
guilders 14991
addition 14983
consolidated 14977
rebel 14968
deutsche 14923
push 14914
ll 14902
sure 14881
van 14874
concerned 14853
filed 14840
university 14836
draft 14834
combined 14821
ever 14820
instead 14807
revised 14791
shanghai 14785
spanish 14758
largely 14756
speech 14740
metals 14731
armed 14718
produce 14705
shrs 14685
managers 14684
soviet 14634
program 14608
jpn 14602
interbank 14600
crown 14575
increases 14560
com 14550
argentina 14527
opinion 14527
lynch 14523
legislation 14509
respectively 14479
deposits 14466
ringgit 14465
diluted 14459
signs 14456
proposals 14454
financing 14449
mean 14448
amounts 14444
strategic 14428
amsterdam 14423
winter 14407
lines 14402
rupiah 14379
environment 14376
grow 14366
damage 14365
delay 14348
loading 14340
bpd 14333
protest 14325
baht 14311
hotel 14296
debate 14281
consider 14267
administrative 14263
extraordinary 14256
receive 14253
class 14237
electronics 14237
polls 14230
king 14222
considered 14210
core 14193
education 14191
romania 14175
fight 14174
commodity 14171
century 14161
polish 14146
producers 14131
moderate 14123
speaking 14108
dispute 14077
peak 14070
attacks 14059
ruled 14055
rejected 14054
metres 14039
consumers 14026
interim 14023
priced 14023
lire 14005
type 13989
verified 13978
ratio 13975
via 13968
greater 13944
benefits 13941
cable 13938
jakarta 13930
why 13920
relatively 13919
mutual 13904
vouch 13901
commerce 13900
democrats 13900
democracy 13875
traffic 13872
station 13856
jumped 13855
site 13838
something 13802
refinery 13800
agreements 13787
wide 13786
laws 13780
invest 13777
alleged 13752
considering 13749
race 13725
motor 13720
socialist 13715
suspended 13709
lowest 13688
develop 13680
placed 13673
indicators 13658
accepted 13653
became 13614
heart 13613
markka 13594
moment 13585
complete 13581
george 13566
equivalent 13565
directors 13552
takeover 13538
river 13528
doing 13524
shipping 13514
currencies 13511
block 13507
arrested 13506
brazilian 13503
experts 13502
immediate 13488
pt 13481
safety 13440
shareholder 13429
values 13411
decide 13391
direction 13388
minority 13385
none 13383
prospects 13382
revs 13374
facility 13371
option 13347
dated 13343
cases 13326
passed 13325
factors 13324
linked 13321
margins 13311
consumption 13289
stand 13288
spring 13285
facilities 13283
turkish 13279
chemical 13278
coal 13277
separate 13273
quickly 13257
shipment 13255
split 13250
affected 13225
possibility 13210
swedish 13209
follow 13208
slipped 13206
le 13205
package 13193
electronic 13182
par 13180
produced 13166
soybean 13152
cause 13128
carry 13112
reduction 13105
elected 13094
standards 13073
raising 13069
payment 13052
florida 13037
choice 13036
austria 13021
volumes 13000
phone 12983
portfolio 12977
fees 12959
ties 12930
charged 12912
nymex 12901
governments 12891
supported 12877
la 12865
pushed 12855
expand 12848
engineering 12847
showing 12842
store 12838
mission 12828
tough 12820
warsaw 12805
brown 12793
transaction 12788
feet 12778
bankers 12775
chemicals 12757
cutting 12751
eased 12750
generally 12715
effort 12702
threat 12694
underlying 12683
throughout 12667
preferred 12651
always 12649
attempt 12647
follows 12642
voters 12642
broke 12636
adjusted 12632
premier 12624
agricultural 12611
straight 12611
smaller 12610
philippines 12604
pension 12599
cargoes 12574
bags 12570
boosted 12567
switzerland 12560
ordered 12538
delayed 12532
anything 12520
wing 12514
hoped 12507
history 12504
required 12504
aluminium 12496
margin 12495
farm 12462
independence 12450
federation 12443
factor 12418
often 12414
setting 12410
ship 12403
drive 12389
various 12378
prevent 12373
expressed 12370
tried 12360
track 12350
maintain 12334
appointed 12331
grew 12330
silver 12327
star 12326
declared 12316
zlotys 12316
controlled 12305
vehicles 12305
toronto 12286
leaving 12278
space 12271
minute 12251
aa 12226
pace 12222
utility 12222
population 12217
dead 12207
returned 12200
regulation 12170
success 12166
thin 12166
brothers 12165
sectors 12156
let 12153
rice 12151
institutional 12137
fast 12129
seats 12128
managed 12103
mexican 12097
internal 12096
fair 12080
peso 12080
mine 12070
suggested 12068
worldwide 12065
franc 12063
weakness 12062
bulgaria 12046
illegal 12040
estate 12036
extended 12032
indonesian 12023
floor 12022
belgium 11994
individual 11994
winning 11973
predicted 11963
jewish 11960
philippine 11950
indicated 11941
homes 11935
boston 11926
tel 11926
moves 11919
acquired 11917
advance 11912
fr 11912
comes 11873
lme 11827
manila 11819
operator 11798
clearly 11792
shipments 11791
accord 11766
consortium 11763
consensus 11761
mail 11752
accounting 11744
latin 11742
portugal 11742
vietnam 11739
refused 11732
matter 11729
tv 11729
bosnia 11716
request 11710
successful 11703
formed 11685
trades 11683
english 11677
johannesburg 11650
pipeline 11650
flow 11640
developing 11630
amt 11623
battle 11612
drugs 11610
statements 11598
responsible 11590
mortgage 11581
bonn 11577
covering 11577
richard 11574
soft 11552
continues 11547
membership 11541
mr 11540
islamic 11537
criteria 11528
flight 11523
spent 11518
abroad 11503
room 11497
madrid 11496
heard 11494
protection 11479
kohl 11460
add 11459
runs 11453
hike 11431
paying 11426
greece 11410
intervention 11409
accept 11405
seems 11389
appeal 11387
fifth 11372
material 11370
sought 11350
lee 11349
beef 11345
arafat 11336
palestinians 11333
cold 11325
opportunity 11324
residents 11316
looks 11313
representatives 11305
executives 11290
digital 11284
avoid 11283
feed 11283
mobutu 11268
popular 11268
confident 11247
player 11233
starts 11223
possibly 11221
thing 11218
agenda 11216
lows 11215
zone 11200
themselves 11194
opportunities 11191
boeing 11171
arrived 11167
suffered 11151
extra 11147
established 11146
mth 11139
scored 11138
targets 11137
demands 11123
tour 11101
martin 11083
meanwhile 11079
killing 11071
netherlands 11070
palm 11064
proceeds 11061
infrastructure 11033
seat 10998
cotton 10997
controls 10995
himself 10992
chips 10978
goi 10976
interior 10976
ger 10973
transactions 10968
joined 10956
injured 10955
hundreds 10920
reuter 10920
emerging 10917
royal 10914
lira 10912
exploration 10903
settled 10899
houses 10887
guerrillas 10885
interested 10879
chancellor 10868
gm 10845
wages 10840
ask 10839
offshore 10839
mass 10836
funding 10835
contact 10834
wholesale 10828
measure 10818
ordinary 10816
los 10813
jerusalem 10809
shows 10809
votes 10806
owns 10803
corruption 10801
heavily 10795
regular 10793
created 10791
bp 10786
treatment 10763
described 10753
flights 10751
colombia 10749
acquire 10748
physical 10748
widely 10748
status 10742
looked 10739
scheme 10735
designed 10718
soybeans 10718
announce 10710
partly 10704
agree 10683
trip 10680
sulphur 10678
arms 10677
ounce 10673
voting 10665
gap 10662
atlantic 10646
nearby 10639
labor 10638
challenge 10632
heating 10631
taleban 10626
your 10622
egypt 10609
chirac 10601
feel 10592
bulk 10591
ord 10580
regulatory 10561
allowing 10560
losing 10558
committed 10551
finland 10548
representative 10548
disease 10538
bomb 10521
emergency 10514
weapons 10501
kuwait 10500
ford 10494
certainly 10490
goals 10487
award 10481
documents 10476
politicians 10469
protests 10469
panel 10458
milan 10440
exporters 10436
attention 10429
vehicle 10426
jordan 10418
keeping 10411
registered 10410
diplomats 10407
grand 10402
nasdaq 10391
ambassador 10390
pricing 10388
rises 10381
born 10376
malaysian 10372
environmental 10359
express 10359
self 10359
totalled 10357
commodities 10352
park 10346
cities 10334
event 10334
maximum 10329
harvest 10320
cement 10319
threatened 10306
playing 10304
rumours 10303
fallen 10300
attorney 10280
commissioner 10272
greek 10272
broad 10265
affect 10253
cbot 10252
scale 10249
supporters 10247
substantial 10244
introduced 10231
green 10208
kind 10202
risen 10202
tomorrow 10198
manufacturer 10190
william 10180
angeles 10178
bullish 10158
failure 10155
favour 10155
acquisitions 10151
worst 10150
strongly 10149
sun 10138
budapest 10136
banco 10110
victims 10108
headquarters 10099
deposit 10087
freight 10080
passenger 10061
toward 10060
recorded 10057
discussions 10053
barley 10043
hurt 10041
sanctions 10040
title 10026
prev 10017
jean 10014
midday 10006
operate 10003
pretty 10000
represents 9998
rain 9986
resume 9977
matches 9976
warning 9976
prison 9975
address 9948
living 9925
shell 9920
wave 9920
tns 9914
commitment 9911
materials 9904
condition 9877
rupee 9877
speed 9877
referring 9876
age 9861
unq 9858
protect 9849
steps 9849
shortly 9840
allegations 9833
lebanon 9828
reference 9817
uncertainty 9809
calling 9800
channel 9797
dinars 9791
agencies 9780
larger 9779
training 9769
conflict 9763
delhi 9756
society 9755
developed 9748
idea 9738
wait 9737
leadership 9731
twice 9730
reaction 9717
requirements 9717
limits 9705
woman 9700
finnish 9687
soccer 9676
meetings 9669
candidate 9662
falls 9656
coach 9649
purchases 9640
fear 9620
carrying 9618
yes 9614
auto 9607
excluding 9603
carrier 9591
square 9588
enter 9585
voted 9579
relief 9568
reasons 9565
significantly 9556
ratings 9549
couple 9547
claim 9543
promised 9536
travel 9530
unaudited 9528
pick 9527
advantage 9525
climbed 9516
spend 9511
ukraine 9499
premiums 9487
repo 9476
el 9472
identified 9470
views 9454
producing 9451
edged 9447
approach 9441
composite 9436
candidates 9430
row 9422
decisions 9420
sri 9417
modest 9413
dole 9411
pending 9407
issuer 9403
provides 9394
ppi 9391
worked 9390
chain 9378
questions 9372
structure 9372
phase 9369
advanced 9367
traditional 9363
headed 9361
kabila 9358
complex 9356
pass 9355
delivered 9349
correction 9343
solid 9335
plane 9322
beyond 9314
crime 9312
buyer 9305
fairly 9298
achieve 9297
band 9288
speculative 9279
paulo 9278
powerful 9275
rotterdam 9268
utilities 9268
stations 9266
fired 9257
officers 9254
opposed 9254
takes 9241
sao 9234
replace 9233
albania 9227
jet 9222
southeast 9216
basic 9212
deadline 9208
everything 9199
diesel 9187
shown 9179
attractive 9171
customer 9164
specific 9154
ethnic 9151
peru 9148
obligation 9136
discussed 9120
expecting 9117
stanley 9116
makers 9111
optimistic 9110
athens 9109
entered 9105
manufacturers 9098
truck 9098
offset 9091
cocoa 9080
events 9075
dominated 9071
initially 9058
driven 9057
delays 9050
diplomatic 9047
maintenance 9045
putting 9031
offices 9029
transfer 9029
mines 9023
operators 9011
depreciation 9006
mobile 9001
reflect 8996
rubber 8996
solution 8996
cif 8989
ftse 8982
schedule 8978
hearing 8975
customs 8971
forints 8958
welfare 8956
ability 8952
cited 8934
shut 8934
felt 8933
true 8928
alone 8915
closely 8915
louis 8898
helsinki 8890
surprise 8888
clients 8884
nz 8872
works 8870
greenspan 8864
zinc 8860
champion 8851
kim 8851
goldman 8849
schools 8849
agm 8848
johnson 8840
table 8840
slaughter 8834
evening 8832
murder 8820
partnership 8806
rated 8804
properties 8796
processing 8791
easing 8785
prft 8780
lawyers 8775
sellers 8773
reporting 8768
repurchase 8768
inside 8763
id 8751
meant 8748
imposed 8745
gone 8744
raw 8735
remarks 8735
bringing 8734
northwest 8733
increasingly 8727
scandal 8726
counter 8720
satellite 8717
aim 8715
multi 8711
container 8705
chris 8700
involving 8699
jose 8694
volatility 8692
agent 8690
intended 8687
nigeria 8687
supreme 8687
send 8686
serb 8681
influence 8679
happen 8674
ten 8674
ing 8668
particular 8666
students 8660
maastricht 8655
equal 8648
arabia 8647
ownership 8645
freedom 8632
hotels 8629
arm 8628
son 8619
wrote 8618
norway 8613
sees 8599
soymeal 8591
draw 8589
load 8583
howard 8577
presence 8574
prompt 8574
sen 8573
lose 8571
microsoft 8563
cautious 8556
constitution 8554
doctors 8554
film 8554
contributed 8549
prague 8545
returns 8532
claimed 8531
minus 8528
rail 8522
christian 8516
ways 8512
ease 8510
citizens 8509
presented 8509
link 8505
faced 8503
suit 8503
valued 8492
egyptian 8489
wife 8489
treasuries 8468
rwanda 8462
prompted 8447
boris 8446
regions 8444
resolution 8440
weight 8440
original 8438
programmes 8437
bottom 8436
seoul 8426
responsibility 8424
directly 8419
reflected 8415
islands 8414
constitutional 8409
granted 8401
criminal 8390
derivatives 8389
closer 8387
incident 8362
operates 8362
imported 8351
dax 8330
transportation 8323
eurobond 8322
recovered 8318
appear 8306
convertible 8305
bay 8304
prosecutors 8293
ipe 8291
entire 8266
believes 8264
surged 8262
duty 8259
enterprises 8258
nikkei 8254
liberal 8243
warrants 8238
rich 8228
doesn 8223
fra 8223
didn 8216
stopped 8209
vessel 8204
eventually 8199
sparked 8194
jail 8186
seeing 8178
highly 8173
dividends 8157
improving 8151
argentine 8148
criticised 8147
facing 8127
determined 8125
developments 8114
effects 8112
serve 8112
controversial 8099
christmas 8098
bear 8095
cancer 8095
renewed 8088
card 8084
powers 8074
technologies 8048
chamber 8046
platinum 8042
awarded 8039
providing 8028
example 8025
style 8020
nickel 8012
regulations 8012
faces 8011
jacques 8003
families 7999
mayor 7999
captain 7998
newly 7997
lawsuit 7994
projected 7987
equities 7985
bosnian 7979
fundamentals 7976
aviation 7972
thomas 7972
iranian 7971
prod 7967
respect 7966
document 7964
finish 7949
ports 7948
deep 7937
foreigners 7937
select 7934
storage 7926
jump 7918
critical 7915
extremely 7914
child 7910
temperatures 7905
surge 7899
resigned 7895
achieved 7894
goes 7889
mills 7880
narrow 7879
lifted 7876
dismissed 7865
usually 7857
alternative 7851
healthy 7849
consolidation 7838
coverage 7838
northeast 7837
witnesses 7837
therefore 7835
cts 7834
indicator 7833
chile 7830
unable 7830
everyone 7828
politics 7828
telecoms 7825
bodies 7818
rio 7812
blair 7811
provisional 7811
wto 7809
seemed 7805
becoming 7804
helping 7802
sports 7797
outcome 7796
alan 7795
covered 7793
journalists 7785
hungarian 7782
reaching 7779
worries 7778
exempt 7772
lawyer 7768
passengers 7764
denmark 7761
kansas 7756
cuba 7752
provisions 7752
croatia 7749
church 7748
cyprus 7747
experience 7745
notice 7744
collapse 7723
section 7720
yellow 7717
heads 7713
receipts 7711
apply 7702
participation 7697
require 7697
person 7689
forex 7686
nomura 7686
fields 7683
massive 7683
seized 7683
teams 7680
pork 7671
originally 7661
brand 7660
embassy 7652
barney 7650
doubt 7640
appears 7636
waigel 7634
extend 7632
admitted 7626
compensation 7624
arrest 7623
generation 7623
fine 7619
criticism 7617
joining 7617
borrowing 7615
distance 7600
bangladesh 7593
blamed 7593
ships 7584
factory 7578
bangkok 7571
written 7570
formal 7563
actually 7557
message 7549
pegged 7530
lehman 7527
neutral 7526
bearish 7524
inventories 7522
willing 7501
jobless 7498
networks 7497
bullion 7493
pushing 7493
accounted 7489
maize 7489
ii 7487
guarantee 7480
volatile 7475
actions 7472
changing 7468
save 7467
retailer 7459
temporary 7457
danish 7453
strikes 7451
elsewhere 7450
relationship 7449
reducing 7447
adj 7446
associated 7445
kroons 7443
inter 7435
broken 7432
mike 7430
otherwise 7430
risks 7428
cap 7426
journal 7425
strengthen 7422
owners 7418
certificates 7417
defeat 7414
fraud 7406
tourism 7404
earned 7403
momentum 7403
books 7401
francisco 7398
search 7392
contributions 7390
anticipated 7389
airways 7382
fixing 7382
suspected 7381
kenya 7376
upper 7372
debts 7369
users 7367
broadcasting 7366
worried 7365
intel 7363
differences 7361
finally 7346
winner 7333
bloc 7329
talking 7326
approve 7325
meat 7321
deputies 7318
triggered 7317
cwt 7312
hill 7311
secondary 7311
sole 7308
career 7306
bob 7302
championship 7295
referendum 7294
abn 7293
firmed 7292
venezuela 7291
yugoslavia 7282
bt 7278
slight 7275
struck 7275
upward 7270
roads 7268
marked 7267
begun 7262
chances 7261
pledged 7253
luxembourg 7249
negotiating 7248
upside 7246
litas 7244
shortage 7242
consecutive 7241
welcomed 7239
submitted 7236
austrian 7233
upon 7232
wounded 7230
gives 7225
swaps 7223
focused 7221
iron 7217
principal 7216
drawn 7207
kuala 7204
village 7191
standing 7189
presidency 7188
picture 7183
charles 7180
easier 7176
allies 7175
briefing 7172
restrictions 7165
sense 7160
inquiry 7155
reais 7151
ill 7149
innings 7142
magazine 7142
whom 7142
acting 7136
quotes 7134
links 7128
lanka 7122
names 7121
hitting 7120
computers 7117
applied 7116
lift 7115
conservatives 7111
prudential 7107
fly 7106
norwegian 7103
secure 7103
seconds 7101
shed 7101
hebron 7099
maintained 7093
mt 7086
prince 7083
application 7077
cubic 7075
broadcast 7074
amro 7072
tightening 7070
conducted 7069
simply 7055
recommended 7047
houston 7025
crucial 7016
thomson 7011
zimbabwe 7011
emerged 7008
participants 7007
representing 7000
rome 6995
americans 6994
lumpur 6994
employers 6987
assistance 6985
neighbouring 6983
apparently 6975
father 6972
indicative 6971
watch 6967
model 6964
bre 6958
nor 6956
happy 6953
item 6952
rivals 6951
ba 6944
pulled 6943
aires 6941
buenos 6938
ira 6936
ranging 6936
sub 6933
storm 6922
center 6921
served 6916
settle 6914
pressures 6910
socialists 6909
secret 6905
brief 6903
jury 6888
subsidiaries 6887
olympic 6882
puts 6881
sachs 6881
containers 6880
excess 6876
reverse 6875
salomon 6872
basket 6868
bushels 6865
ohio 6865
belgrade 6862
route 6862
external 6861
story 6861
miami 6854
creation 6850
delegation 6845
establish 6845
melbourne 6842
virtually 6837
aims 6836
bse 6833
perhaps 6833
preparing 6830
adopted 6822
atlanta 6818
features 6817
expensive 6809
absence 6797
diplomat 6789
noting 6786
quarters 6777
wellington 6776
allows 6775
baghdad 6771
fleet 6771
aggressive 6770
stockholm 6763
sensitive 6759
del 6757
economics 6756
trucks 6756
decade 6754
jersey 6752
handover 6739
borrower 6738
jim 6734
blood 6729
spreads 6727
owner 6724
article 6721
nominal 6716
resolve 6713
guard 6710
resignation 6710
motors 6706
probe 6706
mother 6703
branch 6702
prospect 6701
editorial 6697
cambodia 6695
movements 6695
residence 6693
safe 6687
guerrilla 6685
approximately 6684
deliveries 6671
priority 6671
rebound 6671
calculated 6658
alexander 6657
unc 6655
citing 6651
est 6651
video 6649
apart 6646
task 6643
economies 6642
pretax 6636
annually 6635
papers 6634
severe 6633
zurich 6633
normally 6631
entertainment 6625
ran 6622
streets 6622
tournament 6616
backing 6610
exceptional 6609
rescue 6599
leg 6596
confirm 6595
iss 6587
zero 6584
hot 6581
portuguese 6578
dealing 6577
ec 6576
wales 6572
shift 6565
republicans 6563
attributed 6558
tests 6549
slide 6545
gov 6544
located 6544
slovakia 6540
ubs 6540
profitability 6536
carriers 6530
connection 6525
picked 6515
tony 6512
bell 6507
carlos 6505
dry 6504
tranche 6504
demanded 6501
stream 6496
football 6489
maturing 6482
tu 6482
tom 6481
speaker 6478
asean 6476
prov 6476
dirhams 6474
hsbc 6474
penalty 6472
combination 6468
seasonally 6468
favourable 6464
seem 6456
wrong 6456
compromise 6453
creating 6450
bushel 6449
crash 6448
troubled 6448
commander 6442
downward 6437
crew 6436
read 6435
decades 6433
lives 6431
directive 6419
andrew 6418
waste 6417
exchanges 6416
retirement 6413
injury 6411
discussion 6410
caught 6408
drachmas 6407
driving 6405
exercise 6402
contribution 6401
halt 6400
calendar 6397
bidding 6392
expenditure 6389
camp 6386
trouble 6383
conversion 6381
anyone 6379
missing 6378
intelligence 6375
agents 6372
suffering 6370
integration 6364
colonial 6357
introduce 6356
selected 6356
hang 6351
seriously 6350
content 6347
southwest 6347
uld 6337
divided 6334
compete 6332
edt 6332
ore 6331
rbi 6331
extent 6324
ceasefire 6320
bilateral 6309
applications 6308
kurdish 6304
stance 6303
tone 6300
rapid 6299
surgery 6299
clarke 6294
signing 6292
implementation 6286
banned 6285
democrat 6278
happened 6277
asking 6276
organisations 6275
sec 6273
foods 6268
sbc 6268
soared 6264
tell 6260
arrival 6253
cleared 6247
bigger 6245
attend 6243
effectively 6236
tons 6228
represent 6224
fled 6216
reflecting 6216
breaking 6214
ball 6213
continental 6212
ceremony 6209
promote 6205
components 6204
hog 6204
concluded 6202
adviser 6199
prodi 6197
regarding 6197
religious 6196
guilty 6195
widespread 6194
handling 6191
repeated 6188
liabilities 6186
pointed 6177
train 6175
accident 6174
simpson 6174
crops 6168
please 6168
rwandan 6166
kuna 6162
patients 6150
professional 6148
slowdown 6139
captured 6138
mill 6135
steers 6132
zairean 6132
actively 6129
sixth 6127
holders 6118
appropriate 6111
awaiting 6106
regime 6106
super 6106
monopoly 6105
surprised 6104
telekom 6104
lease 6095
dwt 6094
electoral 6091
expanding 6091
replaced 6090
trends 6085
primarily 6082
burns 6079
foot 6079
attract 6077
handed 6076
roubles 6075
steve 6072
strategist 6071
williams 6071
finding 6069
summary 6067
residential 6065
conc 6061
completely 6057
merge 6056
invited 6053
liberation 6052
shekels 6051
aside 6050
turning 6050
stressed 6046
grant 6044
language 6043
declining 6041
haven 6040
kremlin 6040
burma 6035
crowd 6034
argued 6028
neither 6028
slovak 6023
outright 6020
subsidies 6012
recover 6009
hutu 6008
mw 6007
hostages 6004
recommendation 6001
karachi 5998
terminal 5995
dean 5994
scott 5994
ends 5993
sites 5992
nationwide 5986
fundamental 5979
commencing 5973
qualify 5969
taipei 5968
swap 5962
attempts 5961
midwest 5945
opec 5942
indices 5941
signal 5939
music 5938
represented 5938
delta 5937
railway 5936
amendment 5932
insurer 5926
contribute 5923
era 5923
personnel 5921
ibm 5919
lloyd 5917
transition 5912
forum 5909
permanent 5907
gilts 5906
envoy 5899
clashes 5898
quick 5896
stadium 5894
heading 5890
keen 5889
attacked 5887
rains 5886
dublin 5885
rural 5885
profitable 5884
catholic 5882
dialogue 5880
associates 5865
prove 5865
ocean 5857
structural 5854
bonus 5851
plo 5849
champions 5848
algeria 5844
apple 5840
duties 5839
nv 5834
wireless 5834
payable 5828
des 5826
planes 5824
floating 5820
meal 5816
deliver 5815
organised 5814
sr 5814
zloty 5808
berlin 5806
sustained 5806
bombing 5803
vienna 5803
benjamin 5792
occurred 5790
privately 5790
nationalist 5787
lisbon 5784
convention 5783
bus 5781
credits 5779
principle 5778
generale 5772
returning 5754
danger 5753
levs 5752
tariffs 5752
faster 5749
pri 5747
suppliers 5746
debut 5745
maybe 5738
practice 5738
purchased 5738
bankruptcy 5735
filing 5734
code 5730
manage 5730
write 5730
mediterranean 5728
rallied 5721
ecus 5719
easy 5715
incorporated 5715
petrol 5708
determine 5706
mainland 5706
postponed 5706
encourage 5705
ongoing 5705
roughly 5705
stakes 5703
gallon 5695
sir 5694
lats 5688
schemes 5687
wood 5685
slovenia 5680
valley 5679
invested 5675
hoping 5674
towns 5673
monitoring 5670
syria 5669
hashimoto 5649
excellent 5647
detroit 5643
exceed 5643
chase 5641
winds 5641
licence 5639
assigned 5637
obviously 5637
sessions 5636
coup 5635
damages 5629
expanded 5629
crimes 5621
talked 5619
profile 5618
pesetas 5617
forest 5611
removed 5611
yearly 5610
dealings 5608
welcome 5600
formally 5599
rs 5598
islamist 5595
balanced 5594
machinery 5593
queensland 5591
drilling 5588
pilots 5587
cards 5583
enable 5578
implement 5578
door 5576
lowered 5576
restore 5575
difference 5572
weakened 5567
machines 5564
palladium 5564
bucharest 5560
inventory 5558
heifers 5554
studies 5549
fee 5542
cheaper 5539
shenzhen 5537
completion 5536
online 5535
stayed 5533
pharmaceutical 5532
afghanistan 5531
intention 5531
airbus 5529
cac 5527
cycle 5524
reflects 5522
bhd 5521
columbia 5519
missile 5519
supplier 5519
damaged 5518
introduction 5514
rock 5514
analysis 5507
fix 5504
demanding 5501
prosecutor 5496
unch 5496
failing 5495
mci 5495
negotiate 5495
comex 5492
ali 5490
culture 5489
morocco 5485
individuals 5476
ian 5473
conduct 5460
winners 5460
illinois 5459
cancelled 5455
involvement 5455
mandela 5454
initiative 5452
enterprise 5451
kabul 5451
quota 5447
naphtha 5444
cairo 5439
consideration 5438
albright 5437
image 5434
clean 5432
disappointing 5432
douglas 5431
semi 5430
berth 5429
automotive 5427
carolina 5427
prepare 5426
offerings 5416
opponents 5412
kd 5406
resort 5405
deficits 5401
lithuania 5400
activists 5399
vowed 5398
disclosed 5394
retailers 5392
flood 5387
bull 5386
sound 5386
sofia 5383
lima 5382
resulted 5381
precious 5380
gradually 5376
seng 5372
nd 5366
understand 5366
convicted 5362
pool 5359
protesters 5352
corrects 5349
curve 5348
calm 5347
purchasing 5347
businessmen 5344
midnight 5342
philip 5340
croatian 5339
negotiated 5339
deng 5336
participate 5334
naira 5332
sort 5326
hussein 5321
purposes 5319
wake 5315
somewhat 5314
rapidly 5311
renault 5311
minnesota 5307
refining 5306
closure 5302
autumn 5297
aerospace 5296
requirement 5296
centres 5294
communities 5288
cellular 5287
helmut 5287
motion 5286
sufficient 5285
ounces 5282
testing 5281
commonwealth 5279
sending 5279
engine 5276
dates 5275
proved 5274
ross 5274
blocked 5264
encouraging 5261
records 5259
sheet 5256
milosevic 5255
path 5255
amounted 5252
minor 5252
declines 5248
strict 5246
web 5246
exported 5245
struggling 5243
refineries 5241
fellow 5237
gainers 5237
baltic 5235
tie 5233
fujimori 5232
grades 5232
sets 5232
nigerian 5231
grenfell 5229
sluggish 5227
colony 5225
cst 5225
version 5222
reading 5221
publicly 5220
juppe 5218
lebanese 5216
usd 5215
officially 5213
usual 5208
bzw 5207
legislature 5199
struggle 5199
tariff 5197
humanitarian 5190
feeling 5188
cumulative 5182
answer 5172
historic 5171
frozen 5168
tied 5168
causing 5165
substantially 5164
retain 5163
tenders 5162
appointment 5161
lifting 5161
congressional 5157
resulting 5156
losers 5155
grounds 5152
programs 5152
spoke 5152
seasonal 5151
flows 5149
lebed 5148
kinshasa 5145
dramatic 5144
communists 5143
ventures 5142
pursue 5141
testimony 5141
investigating 5138
check 5136
framework 5136
pensions 5128
ranged 5125
industrials 5124
relative 5124
sentence 5119
ones 5116
assistant 5115
airports 5114
suspension 5113
mitsubishi 5112
flour 5101
brands 5099
obtained 5098
hun 5097
insisted 5094
behalf 5092
nervous 5092
toll 5091
calif 5090
casino 5089
finances 5086
mergers 5085
detailed 5084
ousted 5082
chernomyrdin 5079
dubai 5078
friendly 5071
ita 5067
pulp 5065
detained 5063
conglomerate 5059
difficulties 5058
pope 5056
plunged 5055
allied 5054
encouraged 5054
fought 5054
routes 5051
discontinued 5049
separatist 5046
broader 5039
stepped 5037
barings 5036
pakistani 5034
standings 5032
gaining 5030
seed 5030
philadelphia 5024
bulgarian 5021
importance 5019
design 5018
gen 5018
student 5011
bhp 5008
foundation 5007
fans 5006
chechnya 5005
downside 5003
mood 5003
aware 5000
resumed 5000
serbia 4998
suggest 4996
competitors 4989
input 4988
serving 4986
inflationary 4984
die 4979
flying 4975
radical 4974
shopping 4974
else 4972
georgia 4972
scrap 4970
vw 4967
escudos 4965
explosion 4955
stands 4954
scotland 4952
vital 4952
voice 4950
arrive 4949
nature 4947
slowed 4947
pleased 4945
portion 4941
treasurer 4941
host 4933
mile 4933
striker 4925
unrest 4925
dipped 4923
sam 4923
float 4920
mind 4915
depend 4908
disappointed 4908
amortization 4907
easily 4906
liquid 4906
slowing 4906
shooting 4901
improvements 4899
dan 4898
revolutionary 4894
text 4892
thirds 4891
missiles 4889
operated 4887
beer 4886
publishing 4886
cast 4885
workforce 4884
dn 4883
liberalisation 4883
berisha 4882
critics 4882
procedures 4882
klaus 4879
henry 4877
touch 4875
geneva 4871
hub 4868
dr 4866
albanian 4865
instruments 4864
comparable 4861
periods 4859
visited 4857
extension 4847
edge 4846
warrant 4846
jospin 4844
worse 4834
megawatt 4832
dangerous 4831
procedure 4829
mandate 4826
provincial 4826
soyoil 4826
formula 4824
treated 4823
violent 4823
recovering 4822
contained 4819
household 4819
origin 4816
gaza 4813
estonia 4812
apparent 4809
supporting 4809
cheap 4808
speculators 4808
fishing 4807
lay 4807
reiterated 4807
advances 4806
blow 4806
commitments 4804
suicide 4804
hectares 4802
textile 4801
injuries 4800
spd 4800
cme 4799
christopher 4797
brother 4795
badly 4792
eye 4784
climate 4783
pharmaceuticals 4783
strengthening 4783
semiconductor 4781
upcoming 4780
declaration 4779
schillings 4779
understanding 4779
tech 4777
fighters 4773
civilian 4768
integrated 4768
nelson 4768
defend 4762
hans 4762
boosting 4760
pilot 4758
thus 4757
entering 4753
partial 4753
morris 4751
intends 4748
mgr 4747
placement 4747
forma 4746
word 4742
syndicate 4741
lawmakers 4739
waters 4738
recommendations 4736
bar 4734
definitely 4733
auctions 4732
onto 4729
unity 4727
discharging 4725
teus 4724
questioned 4723
civilians 4720
erbakan 4714
ldd 4711
operational 4711
assessment 4710
grown 4706
pull 4704
repeatedly 4704
resign 4694
bound 4693
kingdom 4692
peaceful 4690
tension 4689
wholly 4689
ecu 4687
concessions 4684
registration 4683
watching 4682
championships 4676
jointly 4675
models 4675
transmission 4675
allegedly 4669
briefly 4669
productivity 4667
quit 4665
totalling 4665
visiting 4665
meets 4664
sbi 4663
telling 4662
courts 4661
holidays 4661
clothing 4659
controlling 4656
marine 4654
modern 4650
sentenced 4650
daniel 4649
collapsed 4648
reasonable 4647
supplied 4645
junior 4644
pore 4641
employee 4639
ads 4637
sport 4637
capitalisation 4633
unveiled 4632
scene 4631
remove 4630
brian 4626
regulators 4625
tea 4625
yugoslav 4624
davis 4622
denominated 4620
science 4619
stephen 4616
implemented 4614
adjustment 4613
fewer 4613
nic 4611
repair 4611
lei 4610
smoking 4610
anniversary 4608
heat 4608
barges 4606
antonio 4605
chrysler 4602
sized 4600
matters 4599
cape 4596
compiled 4594
belarus 4589
practices 4589
purpose 4586
veteran 4585
anz 4583
receiving 4579
timing 4578
riga 4577
tung 4576
drew 4572
resolved 4572
stockholders 4571
objective 4567
bridge 4562
shortfall 4559
produces 4557
licences 4555
du 4554
ind 4552
camps 4551
cigarette 4549
convinced 4545
seventh 4542
fleming 4539
anglo 4538
investing 4538
optimism 4538
tensions 4538
jews 4530
feared 4523
bahrain 4522
navy 4522
traditionally 4518
iowa 4514
insured 4511
revealed 4511
leftist 4508
places 4506
circumstances 4502
essential 4502
wins 4502
command 4501
privatised 4501
witter 4500
buildings 4499
gets 4498
announcing 4497
deregulation 4495
knew 4494
acknowledged 4492
natwest 4489
impossible 4488
tighten 4488
targeted 4482
bunds 4481
lake 4480
separately 4480
patrick 4477
wider 4473
arrangements 4472
decree 4472
attended 4471
frank 4470
carcass 4469
serbian 4468
concrete 4467
drove 4465
obligations 4465
complained 4463
machine 4461
variety 4460
hall 4458
hostage 4457
reductions 4455
barcelona 4454
degree 4454
taylor 4454
potentially 4450
tumbled 4450
ranariddh 4449
golden 4445
banque 4443
lean 4443
impose 4440
rugby 4432
beirut 4430
und 4430
appeals 4429
hamburg 4427
charter 4425
ivory 4425
oklahoma 4425
upgrade 4423
client 4422
colorado 4422
legislative 4422
secured 4422
vast 4422
prisoners 4421
electrical 4420
communication 4419
laid 4418
levy 4418
healthcare 4416
observers 4416
complaint 4415
exposure 4414
insurers 4411
neighbours 4405
sovereignty 4405
switch 4404
roman 4400
cbi 4397
quoting 4394
robust 4394
parents 4393
chosen 4392
concerning 4389
qatar 4384
tunnel 4384
api 4380
berthing 4376
flag 4374
deve 4364
chartered 4363
citibank 4362
liffe 4362
maturities 4362
iii 4359
disaster 4356
highlights 4356
painewebber 4356
manuf 4348
refined 4347
score 4346
ramos 4344
settlements 4344
friends 4343
reluctant 4337
ups 4334
bales 4332
rubin 4325
scores 4325
guaranteed 4324
leads 4319
abu 4318
attracted 4317
generated 4316
defeated 4315
investigators 4315
departure 4312
diamond 4312
issuing 4312
mrta 4311
promises 4311
drivers 4309
immigration 4307
animal 4306
squad 4306
alex 4302
congo 4301
ice 4300
contrast 4297
threatening 4296
di 4293
indication 4293
latvia 4293
viktor 4292
mechanism 4291
basically 4289
generate 4286
burundi 4283
terrorism 4282
clubs 4281
burden 4279
subdued 4275
